#集合的特点是里面的元素是不重复的，而且其中的元素是无序的
list1=[1,2,3,3,4,5,6,8,7]
print(set(list1))
print(len(set(list1)))

#集合中的增---------------------------------------------------------------------------------------------------------------------
#只有一个{}的时候，默认是字典类型，所以没办法声明空集合
s1={1}
s1.add(2)
print(s1)


t1=("a","b","c")
s1.update(t1)
print(s1)

#集合中的删除操作--------------------------------------------------------------------------------------------------------------
s1.remove("a")
print(s1)
s1.discard("d")   #在使用discard删除元素的时候，如果要删除的元素在集合中不存在，并不会抛出异常

s2=s1.pop()  #随机删除，但是一般都会删除第一个元素，将删除掉的元素返回给s2
print(s1,s2)


#集合的交差并集
print("---------------------------------------------------------我是一个分隔符--------------------------------------------------------------------------")
set1={1,2,3,4}
set2={3,4,5,6}
#差集
set3=set2-set1
print(set3)
#交集
set4=set2 & set1
print(set4)
#并集
set5=set1 | set2
print(set5)

#对称差集
result=set1 ^ set2    #^异或操作，取两个集合中不一样的元素
print(result)















